{
  "message": {
    "all": {
      "name": "Message Events",
      "description": "Logs all activities related to messages within the server, including edits, deletions, and bulk deletions. This provides a comprehensive record of message changes and removals for transparency and tracking."
    },
    "edits": {
      "name": "Message Edits",
      "description": "Tracks every instance of a message being edited in the server. This includes capturing the original message, the edits made, and the user who performed the edit, ensuring a history of all message alterations."
    },
    "deletes": {
      "name": "Message Deletes",
      "description": "Logs when any message is deleted from the server. This event captures the identity of the user who deleted the message and provides transparency into message removal activities."
    },
    "bulks": {
      "name": "Message Bulk Deletes",
      "description": "Tracks bulk deletions of messages, where multiple messages are removed at once. This event records the user who initiated the bulk delete and the number of messages affected, providing a detailed log for mass message deletions."
    }
  },
  "member": {
    "roles": {
      "all": {
        "name": "Member Role Events",
        "description": "Logs all changes made to member roles within the server. This includes additions, removals, and updates to roles that affect server permissions and member access."
      },
      "adds": {
        "name": "Member Role Adds",
        "description": "Tracks the addition of roles to members in the server. This helps to monitor the assignment of roles that may grant or remove certain permissions for members."
      },
      "removes": {
        "name": "Member Role Removes",
        "description": "Logs the removal of roles from members. This includes tracking when roles are taken away, helping to ensure role-based permissions are properly managed and documented."
      }
    },
    "names": {
      "all": {
        "name": "Member Name Change Events",
        "description": "Tracks all changes to a member’s display name within the server. This helps to monitor any modifications made to a user’s identity or nickname."
      },
      "users": {
        "name": "Member User Name Changes",
        "description": "Logs any changes to a member’s global username. This provides a detailed history of when a user alters their global account name on Discord."
      },
      "globals": {
        "name": "Member Global Name Changes",
        "description": "Tracks global name changes for members on Discord, capturing when they modify their username that affects all servers they are part of."
      },
      "nicks": {
        "name": "Member Nick Name Changes",
        "description": "Records changes to a member’s nickname within a specific server. This event helps track personal identifier modifications that are unique to individual servers."
      }
    },
    "avatars": {
      "all": {
        "name": "Member Avatar Change Events",
        "description": "Logs all changes to a member’s avatar, providing a complete history of when and how members modify their profile picture across all servers."
      },
      "globals": {
        "name": "Member Global Avatar Changes",
        "description": "Tracks when a member changes their global avatar on Discord, affecting their appearance across all servers they are part of."
      },
      "servers": {
        "name": "Member Server Avatar Changes",
        "description": "Monitors changes to a member’s avatar that are specific to a particular server. This helps keep track of personalized avatars within individual communities."
      }
    },
    "bans": {
      "all": {
        "name": "Member Ban and Unban Events",
        "description": "Logs both ban and unban events for members in the server. This includes tracking when a member is banned or reinstated, ensuring proper moderation and accountability."
      },
      "adds": {
        "name": "Member Bans",
        "description": "Captures when a member is banned from the server, including the reason for the ban and who performed the action. This helps monitor all bans for security and compliance purposes."
      },
      "removes": {
        "name": "Member Unbans",
        "description": "Tracks when a member is unbanned, providing insights into any reinstatements and helping to maintain a log of who was unbanned and by whom."
      }
    },
    "timeouts": {
      "all": {
        "name": "Member Timeout Events",
        "description": "Logs all timeout events where a member is temporarily restricted from interacting within the server. This helps to track any disciplinary actions taken within the community."
      },
      "adds": {
        "name": "Member Timeouts",
        "description": "Records when a member is given a timeout, detailing the user who initiated the action and the duration of the timeout."
      },
      "removes": {
        "name": "Member Timeout Removes",
        "description": "Tracks the removal of a timeout from a member. This event helps to document when and why a member’s timeout is lifted."
      }
    }
  },
  "server": {
    "channels": {
      "all": {
        "name": "Server Channel Events",
        "description": "Logs all channel-related changes in the server, including creation, updates, and deletions. This provides a complete overview of channel management activities."
      },
      "creates": {
        "name": "Server Channel Creates",
        "description": "Records when a new channel is created within the server, capturing details about the channel type and the user who created it."
      },
      "updates": {
        "name": "Server Channel Updates",
        "description": "Tracks when a channel’s settings or configuration are updated, providing a log of changes such as permission updates or category reassignments."
      },
      "deletes": {
        "name": "Server Channel Deletes",
        "description": "Logs when a channel is deleted from the server, including who initiated the removal and which channel was deleted."
      }
    },
    "roles": {
      "all": {
        "name": "Server Role Events",
        "description": "Tracks all events related to server roles, including creation, updates, and deletions. This helps maintain a history of role changes and management in the server."
      },
      "creates": {
        "name": "Server Role Creates",
        "description": "Logs the creation of new roles within the server, including details about the role name, permissions, and the user who created it."
      },
      "updates": {
        "name": "Server Role Updates",
        "description": "Captures any updates made to existing server roles, such as changes to permissions or role assignments."
      },
      "deletes": {
        "name": "Server Role Deletes",
        "description": "Records when roles are deleted from the server, including the details of which role was removed and who performed the deletion."
      }
    },
    "updates": {
      "all": {
        "name": "Server Update Events",
        "description": "Logs all server-wide updates, including changes to settings, server configurations, or major updates that affect the entire server."
      }
    },
    "emojis": {
      "all": {
        "name": "Server Emoji Events",
        "description": "Tracks all emoji management activities in the server, including creation, updates, and deletions. This helps maintain a log of emoji usage and modifications."
      },
      "creates": {
        "name": "Server Emoji Creates",
        "description": "Logs when new emojis are created in the server, providing information about the emoji name and who created it."
      },
      "updates": {
        "name": "Server Emoji Updates",
        "description": "Records when an existing emoji is updated, such as changes to the emoji’s image or name."
      },
      "deletes": {
        "name": "Server Emoji Deletes",
        "description": "Tracks when emojis are deleted from the server, noting which emoji was removed and who performed the deletion."
      }
    },
    "stickers": {
      "all": {
        "name": "Server Sticker Events",
        "description": "Logs all sticker management activities within the server, including creation, updates, and deletions. This is helpful for tracking custom stickers used in the server."
      },
      "creates": {
        "name": "Server Sticker Creates",
        "description": "Tracks the creation of new stickers in the server, including the sticker’s name and the user who created it."
      },
      "updates": {
        "name": "Server Sticker Updates",
        "description": "Records updates made to existing stickers, such as changes to their name or image."
      },
      "deletes": {
        "name": "Server Sticker Deletes",
        "description": "Captures when a sticker is deleted from the server, including the identity of the user who removed it."
      }
    }
  },
  "voice": {
    "all": {
      "name": "Voice Channel Events",
      "description": "Logs all activities related to voice channels in the server, including member joins, moves, and leaves. This helps monitor voice channel participation."
    },
    "joins": {
      "name": "Voice Channel Joins",
      "description": "Tracks when members join voice channels, providing a record of who is participating in voice chats."
    },
    "moves": {
      "name": "Voice Channel Moves",
      "description": "Logs when members are moved between different voice channels, capturing the action and the user performing the move."
    },
    "leaves": {
      "name": "Voice Channel Leaves",
      "description": "Records when members leave voice channels, helping to monitor the activity and participation within voice chats."
    }
  },
  "joinLeave": {
    "all": {
      "name": "Member Join-Leave Events",
      "description": "Tracks when members join or leave the server, including both initial joins and exits. This provides insights into server activity and membership changes."
    },
    "joins": {
      "name": "Member Joins",
      "description": "Logs when a member joins the server, capturing the member's identity and the time of the join."
    },
    "leaves": {
      "name": "Member Leaves",
      "description": "Records when a member leaves the server, whether voluntarily or by other means, and provides a history of exits."
    }
  },
  "moderation": {
    "warns": {
      "all": {
        "name": "Warn Events",
        "description": "Logs all warning events issued to members, including the reasons for warnings and who issued them. This helps maintain a history of disciplinary actions."
      },
      "adds": {
        "name": "Warn Adds",
        "description": "Tracks when a warning is issued to a member, including the specific reason and the user who gave the warning."
      },
      "removes": {
        "name": "Warn Removes",
        "description": "Logs when a warning is removed from a member’s record, helping to keep track of the removal of warnings for accountability."
      },
      "clears": {
        "name": "Warn Clears",
        "description": "Records when all warnings for a member are cleared, helping to manage a member's warning history."
      }
    },
    "mutes": {
      "name": "Mute Events",
      "description": "Tracks all mutes applied to members, including the reason for the mute and the duration of the mute, ensuring that disciplinary actions are properly documented."
    },
    "unmutes": {
      "name": "Unmute Events",
      "description": "Logs when a member is unmuted, capturing the action and ensuring transparency in the removal of mutes."
    },
    "timeouts": {
      "all": {
        "name": "All Timeout Events",
        "description": "Logs all timeout events applied to members, including the duration and reason for the timeout. This provides a detailed record of time-based restrictions."
      },
      "adds": {
        "name": "Timeout Events",
        "description": "Tracks when a member is given a timeout, capturing the start time and duration of the timeout."
      },
      "removes": {
        "name": "Timeout Remove Events",
        "description": "Records when a timeout is removed from a member, detailing the user who lifted the timeout and when it was removed."
      }
    },
    "kicks": {
      "name": "Kick Events",
      "description": "Logs when a member is kicked from the server, including the reason for the kick and the user who performed the action."
    },
    "bans": {
      "all": {
        "name": "All Ban Events",
        "description": "Tracks all ban events, including permanent, soft, and temporary bans, providing detailed logs for ban actions taken against members."
      },
      "regulars": {
        "name": "Regular Ban Events",
        "description": "Logs all permanent bans within the server, detailing the reason for the ban and the user who issued it."
      },
      "softs": {
        "name": "Soft Ban Events",
        "description": "Records soft bans, where members are temporarily banned and then automatically unbanned, providing transparency for temporary bans."
      },
      "temps": {
        "name": "Temp Ban Events",
        "description": "Tracks temporary bans within the server, including the reason, duration, and user who issued the temporary ban."
      }
    },
    "unbans": {
      "name": "Unban Events",
      "description": "Logs when a member is unbanned from the server, including the reason for the unban and who performed the action."
    }
  }
}
